In [2]:
# a Jupyter notebook to investigate the data before creating import script
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy.types import *
from mysecrets import user, password

engine = create_engine(f'postgresql://{user}:{password}@localhost:5432/book_recs')

In [9]:
def search_author(con, text):
    temp = pd.read_sql(
        f"""
        SELECT *
        FROM BUILD_BOOK_AUTHORS
        WHERE AUTHOR_NAME ~ '{text.upper()}'
        ORDER BY RATINGS_COUNT DESC
        """,
        con
    )

    return temp

search_author(engine, 'vonneg')

,author_name,author_id,text_reviews_count,ratings_count,average_rating
0,KURT VONNEGUT JR.,2778055,62047,2021453,4.05
1,MARK VONNEGUT,15852,525,4921,3.80
2,KURT VONNEGUT,10682666,64,1074,4.05
3,NORB VONNEGUT,2885702,157,833,3.68
4,KURTS VONNEGUTS,3178555,4,141,3.96
5,NANETTE VONNEGUT,7189257,15,137,4.26
6,LAUREEN VONNEGUT,15853,11,51,3.06
7,JANE VONNEGUT YARMOLINSKY,216807,4,14,3.36
8,KIRK VONNEGUT,11210476,3,13,4.00

In [16]:
def search_title(con, text):
    temp = pd.read_sql(
        f"""
        SELECT *
        FROM BUILD_WORKS
        WHERE TITLE ~ '{text.upper()}'
        ORDER BY RATINGS_COUNT DESC
        """,
        con
    )

    return temp

search_title(engine, 'player piano')

,work_id,average_rating,ratings_count,text_reviews_count,title
0,1005005,3.85,36855,1401,PLAYER PIANO
1,6163096,4.34,565,30,SLAUGHTERHOUSE FIVE/ THE SIRENS OF TITAN/ PLAY...
2,18275651,4.50,169,18,NOVELS & STORIES 1950-62: PLAYER PIANO/THE SIR...

In [15]:
def get_author_books(con, author_id):
# author_id = 2778055
    temp = pd.read_sql(
        f"""
        SELECT *
        FROM BUILD_AUTHORS
        INNER JOIN BUILD_WORKS
        USING(WORK_ID)
        WHERE AUTHOR_ID = {author_id}
        ORDER BY RATINGS_COUNT DESC
        """,
        con
    )

    return temp

get_author_books(engine, 2778055)

,work_id,author_id,average_rating,ratings_count,text_reviews_count,title
0,1683562,2778055,4.06,901734,19429,SLAUGHTERHOUSE-FIVE
1,1621115,2778055,4.18,276170,8008,CAT'S CRADLE
2,2859378,2778055,4.08,188114,5268,BREAKFAST OF CHAMPIONS
3,905970,2778055,4.16,85328,3302,THE SIRENS OF TITAN
4,1222244,2778055,4.21,57326,2189,MOTHER NIGHT
...,...,...,...,...,...,...
81,54321006,2778055,3.88,8,1,GRAVE PREDICTIONS: TALES OF MANKIND'S POST-APO...
82,55316324,2778055,4.00,4,1,QUE LEVANTE MI MANO QUIéN CREA EN LA TELEQUINE...
83,21598264,2778055,4.18,3,1,UNREADY TO WEAR
84,54545905,2778055,4.33,3,1,TWO BY VONNEGUT: THE BIG TRIP UP YONDER AND 2B...
85,42705413,2778055,3.76,1,1,TOMORROW AND TOMORROW AND TOMMORROW

In [186]:
def get_similar_works(con, work_ids):
    temp = pd.read_sql(
        f"""
        -- GET RELEVANT TAGS
        WITH A AS (
            SELECT
                TAG_NAME,
                CAST(TAG_COUNT AS FLOAT) / TAG_TOTAL_COUNT AS PERC1,
                --CAST(TAG_COUNT AS FLOAT) / WORK_TOTAL_COUNT AS PERC2,
                1 / CAST(TAG_NUM_WORK AS FLOAT) AS PERC3 
            FROM BUILD_TAGS
            WHERE WORK_ID IN ({', '.join(str(id) for id in work_ids)})
            ORDER BY CAST(TAG_COUNT AS FLOAT) / TAG_TOTAL_COUNT DESC
        ),
        -- GET TOTAL METRICS
        B AS (
            SELECT 
                TAG_NAME,
                1 AS KEY,
                COUNT(*) AS NUM_MATCH,
                SUM(PERC1) AS PERC1,
                --SUM(PERC2) AS PERC2,
                SUM(PERC3) AS PERC3
            FROM A 
            GROUP BY TAG_NAME
        ),
        -- FIND PERCENTILE
        C AS (
            SELECT
                1 AS KEY,
                PERCENTILE_DISC(0.5) WITHIN GROUP(ORDER BY NUM_MATCH) AS MATCH_MEDIAN,
                PERCENTILE_DISC(0.5) WITHIN GROUP(ORDER BY PERC1) AS PERC1_MEDIAN,
                PERCENTILE_DISC(0.5) WITHIN GROUP(ORDER BY PERC3) AS PERC3_MEDIAN
            FROM B
            GROUP BY KEY
        ),
        -- SUBSET TO TOP HALF
        D AS (
            SELECT * 
            FROM C
            INNER JOIN B 
            USING(KEY)
            WHERE PERC1 > PERC1_MEDIAN
            AND PERC3 > PERC3_MEDIAN
            AND NUM_MATCH >= MATCH_MEDIAN
        ),
        -- GET TOP 100 WORKS THAT HAD THESE TAGS
        E AS (
            SELECT 
                WORK_ID,
                COUNT(*) AS NUM_OVERLAP
            FROM D
            INNER JOIN BUILD_TAGS
            USING(TAG_NAME)
            WHERE WORK_ID NOT IN ({', '.join(str(id) for id in work_ids)})
            GROUP BY WORK_ID
            ORDER BY NUM_OVERLAP DESC
            LIMIT 100
        ),
        -- FOR DEBUGGING
        F AS (
            SELECT 
                WORK_ID,
                TITLE,
                AUTHOR_NAME,
                BUILD_WORKS.AVERAGE_RATING AS AVERAGE_RATING,
                BUILD_WORKS.RATINGS_COUNT AS RATINGS_COUNT,
                BUILD_WORKS.TEXT_REVIEWS_COUNT AS TEXT_REVIEWS_COUNT,
                NUM_OVERLAP
            FROM E
            INNER JOIN BUILD_WORKS
            USING(WORK_ID)
            INNER JOIN BUILD_AUTHORS
            USING(WORK_ID)
            INNER JOIN BUILD_BOOK_AUTHORS
            USING(AUTHOR_ID)
            ORDER BY NUM_OVERLAP DESC
        )
        SELECT * 
        FROM F
        """,
        con
    )
    
    return temp
    # return tags.loc[(tags['perc1'] > np.median(tags['perc1'])) & (tags['perc3'] > np.median(tags['perc3'])), 'tag_name']

similar_works = get_similar_works(engine, [50717723])

In [162]:
search_author(engine, 'salinger')

,author_name,author_id,text_reviews_count,ratings_count,average_rating
0,J.D. SALINGER,819789,57171,2508459,3.83
1,MARGARET A. SALINGER,3481,86,720,3.36
2,PIERRE SALINGER,62269,21,265,3.52
3,NICOLE SALINGER,236392,4,69,3.84
4,MICHAEL SALINGER,434350,5,50,4.10
5,ADRIENNE SALINGER,3480,8,44,4.14
6,STEVEN DAVID SALINGER,193739,4,34,3.24
7,MANIA SALINGER,32819,8,28,4.14
8,WENDY SALINGER,7173,2,15,3.53
9,ORNA SALINGER,4101279,3,10,4.40
10,HERMAN SALINGER,862330,1,6,3.83
11,SHARON S. SALINGER,123501,1,3,4.00
12,RUDIN SALINGER,4171805,1,3,4.67
13,WARREN SALINGER,114019,1,1,4.00
14,G.L. SALINGER,15583084,1,1,4.00
15,MERGARETTA SALINGER,17251849,1,0,0.00

In [166]:
search_title(engine, 'player piano')

,work_id,average_rating,ratings_count,text_reviews_count,title
0,1005005,3.85,36855,1401,PLAYER PIANO
1,6163096,4.34,565,30,SLAUGHTERHOUSE FIVE/ THE SIRENS OF TITAN/ PLAY...
2,18275651,4.50,169,18,NOVELS & STORIES 1950-62: PLAYER PIANO/THE SIR...

In [163]:
get_author_books(engine, 819789)

,work_id,author_id,average_rating,ratings_count,text_reviews_count,title
0,3036731,819789,3.79,2137777,43577,THE CATCHER IN THE RYE
1,3118417,819789,3.98,161951,5170,FRANNY AND ZOOEY
2,1839377,819789,4.19,114530,3242,NINE STORIES
3,1839410,819789,4.11,39616,1323,"RAISE HIGH THE ROOF BEAM, CARPENTERS & SEYMOUR..."
4,11061202,819789,4.34,6358,150,A PERFECT DAY FOR BANANAFISH
5,41707471,819789,3.68,1671,135,THREE EARLY STORIES
6,3199125,819789,3.66,892,50,"HAPWORTH 16, 1924"
7,55846478,819789,4.27,767,34,THE CATCHER IN THE RYE/FRANNY AND ZOOEY/NINE S...
8,123871,819789,4.29,715,37,THE COMPLETE UNCOLLECTED STORIES
9,21741855,819789,3.81,356,12,THE LAUGHING MAN
10,48530194,819789,4.49,248,3,NINE STORIES. FRANNY AND ZOOEY. RAISE HIGH THE...
11,23685959,819789,3.77,222,6,UNCLE WIGGILY IN CONNECTICUT
12,21696327,819789,4.29,213,24,THE OCEAN FULL OF BOWLING BALLS
13,43750213,819789,3.83,192,16,A GIRL I KNEW
14,23685973,819789,4.00,190,7,PRETTY MOUTH AND GREEN MY EYES
15,23685963,819789,3.67,171,3,JUST BEFORE THE WAR WITH THE ESKIMOS
16,3758953,819789,3.61,58,5,نغمه غمگین
17,50524253,819789,3.38,54,11,J. D. SALINGER: THE LAST INTERVIEW AND OTHER C...
18,44733229,819789,4.52,54,8,THE HEART OF A BROKEN STORY
19,46309298,819789,3.50,45,3,THE YOUNG FOLKS
20,4648117,819789,3.58,38,8,THE INVERTED FOREST
21,21808967,819789,3.96,28,2,BOTH PARTIES CONCERNED
22,43890214,819789,4.07,25,1,I'M CRAZY
23,49150590,819789,3.42,18,1,FRANNY
24,43578481,819789,3.17,18,1,BIRTHDAY BOY
25,43578214,819789,3.29,17,2,PAULA
26,45525314,819789,4.07,15,1,"A BOY IN FRANCE (BABE GLADWALLER, #2)"
27,55088224,819789,4.00,4,1,J. D. SALINGER: THE LAST INTERVIEW: AND OTHER ...
28,6840973,819789,5.00,1,1,サリンジャー選集(3) 倒錯の森〈短編集2〉

In [183]:
get_similar_works(engine, [3036731, 1005005, 1168289, 481854, 860196, 2100252, 1222661, 2368224	, 1701188	]).head(40).tail(10)

,work_id,title,author_name,average_rating,num_overlap
30,69741,THE OLD MAN AND THE SEA,ERNEST HEMINGWAY,3.73,32
31,3347070,TO HAVE AND HAVE NOT,ERNEST HEMINGWAY,3.57,32
32,1209450,THE MOVIEGOER,WALKER PERCY,3.70,32
33,1121143,INTRUDER IN THE DUST,WILLIAM FAULKNER,3.74,32
34,1426723,THE CRUCIBLE,ARTHUR MILLER,3.55,32
35,3118417,FRANNY AND ZOOEY,J.D. SALINGER,3.98,32
36,1324493,THE GLASS MENAGERIE,TENNESSEE WILLIAMS,3.67,32
37,551195,RAGTIME,E.L. DOCTOROW,3.88,32
38,4574850,A PASSAGE TO INDIA,E.M. FORSTER,3.67,31
39,1257919,DELIVERANCE,JAMES DICKEY,3.86,31